#+TITLE: D Genome Survey
#+AUTHOR: Tony Arick
#+TODO: BAD TODO | GOOD QUEUE DONE SKIP
#+DRAWERS: HIDDEN
#+OPTIONS: d:RESULTS 
#+STARTUP: hideblocks align

#+PROPERTY:  header-args :exports results :eval never-export
#+OPTIONS: ^:nil 

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>

#+HTML_HEAD: <script src="https://ajax.googleapis.com/ajax/libs/jquery/2.1.3/jquery.min.js"></script>
#+HTML_HEAD: <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.4/js/bootstrap.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/readtheorg/js/readtheorg.js"></script>

#+NAME: plotQuality
#+HEADER: :var fwd="" :var rev=""
#+BEGIN_SRC R  :results output graphics :width 1024 :height 600
  library(ShortRead)
  library(ggplot2)
  library(reshape2)

  reads <- list('Forward'  = as.character(fwd),
                'Reverse' = as.character(rev))
  qaSum <- lapply(reads, qa)
  perCycleQual <- lapply(qaSum, function(x) x[["perCycle"]]$quality)

  ## quant <- lapply(perCycleQual, function(perCycleQual) {
  ##                     rbind(melt(t(sapply(by(list(perCycleQual$Score, perCycleQual$Count), perCycleQual$Cycle,
  ##                                            function(x) quantile(Rle(x[[1]], x[[2]]), c(0.25, 0.5, 0.75))), unlist))),
  ##                           data.frame(Var1=unique(perCycleQual$Cycle), Var2='Mean',
  ##                                      value=rowsum(perCycleQual$Score * perCycleQual$Count, perCycleQual$Cycle)/
  ##                                          rowsum(perCycleQual$Count, perCycleQual$Cycle)))
  ##                 })
  ## quant <- melt(quant, id.vars=c('Var1', 'Var2', 'value'))
* References
:PROPERTIES:
:ID:       447d137a-9e5a-42db-b4c7-1d313c5f8052
:END:

-[[ftp://ftp.bioinfo.wsu.edu/species/Gossypium_raimondii/JGI_221_G.raimondii_Dgenome/assembly/G.raimondii_JGI_221_v2.0.assembly.fasta.gz][JGI D5 genome]]

#+NAME: sra_ref
| Accession | Genome Size | SRA number | SRA Run    |
|-----------+-------------+------------+------------|
| A1-97     |        1667 | SRR617284  | SRR617284  |
| A1-73     |        1667 | SRR849166  | SRR849166  |
| A1-155    |        1667 | SRR847953  | SRR847953  |
| A2-BGI    |        1698 | SRR1216980 | SRR1216980 |
| A2-JCVI   |        1698 | SRR959522  | SRR959522  |
| A2_44     |        1698 | SRR849219  | SRR849219  |
| A2_1011   |        1698 | SRR847923  | SRR847923  |
| A2_4      |        1698 | SRR847945  | SRR847945  |
| A2_34     |        1698 | SRR847922  | SRR847922  |
| D5_ref    |         880 | SRX027740  | SRR067821  |
| D5_2      |         880 | SRR847961  | SRR847961  |
| D5_4      |         880 | SRR847974  | SRR847974  |
| D5_31     |         880 | SRR847980  | SRR847980  |
| D5_53     |         880 | SRR847981  | SRR847981  |
| F1-1      |        1311 | SRX204849  | SRR617704  |
#+TBLFM: $4='(org-sbe SRAdb (acc $$3))

#+HEADER: :shebang #!/bin/bash :tangle sra/download.sh :mkdirp yes
#+BEGIN_SRC sh :var libs=sra_ref[12:15,]
  PATH=$PATH:/usr/local/igbb/sratoolkit.2.4.5-2/bin/:/home/maa146/.aspera/connect/bin/
  KEY=/home/maa146/.aspera/connect/etc/asperaweb_id_dsa.openssh

  pushd sra

  IFS=$'\t'
  while read -a lib; do 
      if [ -e "${lib[3]}" ]; then 
         echo $(date) ${lib[3]} Previously Completed
         continue; 
      fi
      echo $(date) ${lib[3]} Started
      ascp -i $KEY -pQTk1 -l 800m dbtest@sra-download.ncbi.nlm.nih.gov:data/sracloud/srapub/${lib[3]} ./
      #fastq-dump --gzip --outdir raw --split-files --split-spot ${lib[3]}
      echo $(date) ${lib[3]} Finished
  done <<<"$libs"

  popd

  while read -a lib; do 
      echo $(date) ${lib[3]} Started
      mkdir raw/${lib[0]}
      fastq-dump --gzip --outdir raw/${lib[0]} --split-files --split-spot sra/${lib[3]}
      echo $(date) ${lib[3]} Finished
  done <<<"$libs"

#+END_SRC

#+NAME: raw_ref
| Library               | Type   | Encoding |                   Forward Read |                   Reverse Read |
|-----------------------+--------+----------+--------------------------------+--------------------------------|
| <21>                  |        |          |                          <r30> |                          <r30> |
| A1-97                 | DNA-PE |       33 | raw/A1-97/SRR617284_1.fastq.gz | raw/A1-97/SRR617284_1.fastq.gz |
| A1-73                 | DNA-PE |       33 | raw/A1-73/SRR849166_1.fastq.gz | raw/A1-73/SRR849166_1.fastq.gz |
| A1-155                | DNA-PE |       33 | raw/A1-155/SRR847953_1.fastq.gz | raw/A1-155/SRR847953_1.fastq.gz |
| A2-BGI                | DNA-PE |       33 | raw/A2-BGI/SRR1216980_1.fastq.gz | raw/A2-BGI/SRR1216980_1.fastq.gz |
| A2-JCVI               | DNA-PE |       33 | raw/A2-JCVI/SRR959522_1.fastq.gz | raw/A2-JCVI/SRR959522_1.fastq.gz |
| A2_44                 | DNA-PE |       33 | raw/A2_44/SRR849219_1.fastq.gz | raw/A2_44/SRR849219_1.fastq.gz |
| A2_1011               | DNA-PE |       33 | raw/A2_1011/SRR847923_1.fastq.gz | raw/A2_1011/SRR847923_1.fastq.gz |
| A2_4                  | DNA-PE |       33 |  raw/A2_4/SRR847945_1.fastq.gz |  raw/A2_4/SRR847945_1.fastq.gz |
| A2_34                 | DNA-PE |       33 | raw/A2_34/SRR847922_1.fastq.gz | raw/A2_34/SRR847922_1.fastq.gz |
| D5_ref                | DNA-PE |       33 | raw/D5_ref/SRR067821_1.fastq.gz | raw/D5_ref/SRR067821_1.fastq.gz |
| F1-1                  | DNA-PE |       33 |  raw/F1-1/SRR617704_1.fastq.gz |  raw/F1-1/SRR617704_1.fastq.gz |
            
* Trimmomatic
:PROPERTIES:
:ID:       0ff1f96b-94a0-4a4c-83b7-91d0bbbd48af
:END:
#+NAME: raw_files
#+BEGIN_SRC sh :var raw=raw_new[3:-1,] :var ref=raw_ref[3:-1,]
cat <<<"$raw"
cat <<<"$ref"
#+END_SRC

D10 had a error in the library making the last 40bp  questionable. So, those
reads were re-trimmed with minlen60

#+HEADER: :shebang #!/bin/bash :tangle trim/trim.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N Trim -l nodes=1:ppn=20 -l walltime=48:00:00 -t 93-124
#+BEGIN_SRC sh :var libs=raw_files :var DIR=(file-name-directory buffer-file-name) 
  cd $DIR

  TRIMER=/usr/local/igbb/trimmomatic/trimmomatic-0.32.jar
  ADAPTERS=/usr/local/igbb/trimmomatic/adapters/all.fa

  TRIM="$DIR/trim"

  IFS=$'\t'
  read -a lib < <(sed -n -e "${PBS_ARRAYID}p" <<<"$libs")

  TRM_PE_R1=$TRIM/${lib[0]}.PE.R1.fq.gz
  TYPE=SE

  if [ -n "${lib[4]}" ] ;then 
      TRM_SE_R1=$TRIM/${lib[0]}.SE.R1.fq.gz
      
      TRM_PE_R2=$TRIM/${lib[0]}.PE.R2.fq.gz
      TRM_SE_R2=$TRIM/${lib[0]}.SE.R2.fq.gz

      TYPE=PE
  fi

  java -jar $TRIMER $TYPE -threads $PBS_NUM_PPN -phred${lib[2]} \
       $DIR/${lib[3]} $DIR/${lib[4]} $TRM_PE_R1 $TRM_SE_R1 $TRM_PE_R2 $TRM_SE_R2 \
       ILLUMINACLIP:$ADAPTERS:2:30:15 LEADING:28 TRAILING:28 SLIDINGWINDOW:8:28 SLIDINGWINDOW:1:10 MINLEN:85 TOPHRED33 \
  &> $TRIM/${lib[0]}.log

#+END_SRC

#+BEGIN_SRC sh :results output table :var libs=raw_files[,0]
xargs -i  grep -H 'Input Read Pairs' trim/{}.log  <<<"$libs" | sed -e 's#.*/##' -e 's/\.log:[^:]*: / /' -e 's/ [^:)0-9]*: / /g'
#+END_SRC

#+RESULTS:
#+CAPTION: Timming Stats (Divided by Species, Sorted by Percent Paired)
#+NAME: trim_stats
| Library               |       Raw |    Paired | %        |  Forward | %        | Reverse | %        |   Dropped | %        |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| AD1-DNWC1324.Ghirs1.5 |  99966743 |  75801535 | (75.83%) |  8902238 | (8.91%)  | 2602912 | (2.60%)  |  12660058 | (12.66%) |
| AD1-DNWC1324.Ghirs1.4 |  96772450 |  73124274 | (75.56%) |  8431081 | (8.71%)  | 2693078 | (2.78%)  |  12524017 | (12.94%) |
| AD1-DNWC1324.Ghirs1.3 |  63894170 |  44445640 | (69.56%) |  5990638 | (9.38%)  | 4324979 | (6.77%)  |   9132913 | (14.29%) |
| AD1-DNWC1324.Ghirs1.2 |  61464717 |  42757789 | (69.56%) |  5660217 | (9.21%)  | 4258417 | (6.93%)  |   8788294 | (14.30%) |
| AD1-DNWC1324.Ghirs1.1 |  27955240 |  21361883 | (76.41%) |  3059056 | (10.94%) |  943191 | (3.37%)  |   2591110 | (9.27%)  |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D10-8.Gturn1.9        |  37508085 |   8716771 | (23.24%) |  5139939 | (13.70%) | 3853084 | (10.27%) |  19798291 | (52.78%) |
| D10-8.Gturn1.10       |  36423990 |   7110827 | (19.52%) |  4881224 | (13.40%) | 3855349 | (10.58%) |  20576590 | (56.49%) |
| D10-8.Gturn1.12       |  35591290 |   6941215 | (19.50%) |  4548603 | (12.78%) | 3633924 | (10.21%) |  20467548 | (57.51%) |
| D10-8.Gturn1.11       |  35448283 |   5404926 | (15.25%) |  4438176 | (12.52%) | 3278272 | (9.25%)  |  22326909 | (62.98%) |
| D10-8.Gturn1.2        |  19762413 |       191 | (0.00%)  |     6951 | (0.04%)  |   10628 | (0.05%)  |  19744643 | (99.91%) |
| D10-8.Gturn1.6        |  15396101 |       186 | (0.00%)  |     6587 | (0.04%)  |    9756 | (0.06%)  |  15379572 | (99.89%) |
| D10-8.Gturn1.1        |  19235210 |       158 | (0.00%)  |     6587 | (0.03%)  |    8172 | (0.04%)  |  19220293 | (99.92%) |
| D10-8.Gturn1.5        |  14798027 |       152 | (0.00%)  |     6070 | (0.04%)  |    7401 | (0.05%)  |  14784404 | (99.91%) |
| D10-8.Gturn1.3        |  16758138 |        26 | (0.00%)  |     1824 | (0.01%)  |    2668 | (0.02%)  |  16753620 | (99.97%) |
| D10-8.Gturn1.7        |  12370391 |        24 | (0.00%)  |     1641 | (0.01%)  |    2372 | (0.02%)  |  12366354 | (99.97%) |
| D10-8.Gturn1.4        |  16297999 |        17 | (0.00%)  |      877 | (0.01%)  |    2879 | (0.02%)  |  16294226 | (99.98%) |
| D10-8.Gturn1.8        |  12267659 |        17 | (0.00%)  |      808 | (0.01%)  |    2530 | (0.02%)  |  12264304 | (99.97%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D11-1.Gschw1.6        |  82022453 |  55943217 | (68.20%) |  7908127 | (9.64%)  | 5959669 | (7.27%)  |  12211440 | (14.89%) |
| D11-1.Gschw1.5        |  68828834 |  47482765 | (68.99%) |  6358246 | (9.24%)  | 4979427 | (7.23%)  |  10008396 | (14.54%) |
| D11-1.Gschw1.2        |  36765023 |  25814652 | (70.22%) |  4394257 | (11.95%) | 1757423 | (4.78%)  |   4798691 | (13.05%) |
| D11-1.Gschw1.4        |  37762467 |  24875672 | (65.87%) |  5938762 | (15.73%) | 1617037 | (4.28%)  |   5330996 | (14.12%) |
| D11-1.Gschw1.1        |  35782697 |  24868771 | (69.50%) |  4475175 | (12.51%) | 1704836 | (4.76%)  |   4733915 | (13.23%) |
| D11-1.Gschw1.3        |  37790686 |  24225002 | (64.10%) |  6292975 | (16.65%) | 1653490 | (4.38%)  |   5619219 | (14.87%) |
| D11-1.Gschw1.7        |   4338260 |   3267815 | (75.33%) |   518365 | (11.95%) |  198642 | (4.58%)  |    353438 | (8.15%)  |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D1-2.Gthur1.7         |  29674124 |  21439669 | (72.25%) |  2784743 | (9.38%)  |  673455 | (2.27%)  |   4776257 | (16.10%) |
| D1-2.Gthur1.8         |  22340849 |  15684586 | (70.21%) |  2684167 | (12.01%) |  713174 | (3.19%)  |   3258922 | (14.59%) |
| D1-2.Gthur1.5         |  26811636 |  11980194 | (44.68%) |  9122064 | (34.02%) |  297923 | (1.11%)  |   5411455 | (20.18%) |
| D1-2.Gthur1.6         |  28083257 |       200 | (0.00%)  |  1848739 | (6.58%)  |     991 | (0.00%)  |  26233327 | (93.41%) |
| D1-2.Gthur1.2         |   9996915 |        85 | (0.00%)  |     2866 | (0.03%)  |    3428 | (0.03%)  |   9990536 | (99.94%) |
| D1-2.Gthur1.1         |   9572890 |        80 | (0.00%)  |     2708 | (0.03%)  |    2844 | (0.03%)  |   9567258 | (99.94%) |
| D1-2.Gthur1.3         |   9185658 |        13 | (0.00%)  |      830 | (0.01%)  |     981 | (0.01%)  |   9183834 | (99.98%) |
| D1-2.Gthur1.4         |  10154700 |         6 | (0.00%)  |      461 | (0.00%)  |    1375 | (0.01%)  |  10152858 | (99.98%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D1-35.Gthur2.5        |  53486228 |  39882072 | (74.57%) |  6817191 | (12.75%) | 2293094 | (4.29%)  |   4493871 | (8.40%)  |
| D1-35.Gthur2.1        |  34446258 |  24885748 | (72.25%) |  3769681 | (10.94%) | 1640253 | (4.76%)  |   4150576 | (12.05%) |
| D1-35.Gthur2.3        |  31081204 |  21045657 | (67.71%) |  3111177 | (10.01%) | 2060670 | (6.63%)  |   4863700 | (15.65%) |
| D1-35.Gthur2.2        |  31195897 |  20731150 | (66.45%) |  3260271 | (10.45%) | 2175017 | (6.97%)  |   5029459 | (16.12%) |
| D1-35.Gthur2.4        |  30794072 |  20419039 | (66.31%) |  3117140 | (10.12%) | 2272999 | (7.38%)  |   4984894 | (16.19%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D2-1-6.Garmo1.1       |  38625502 |  27329426 | (70.75%) |  4530442 | (11.73%) | 1833520 | (4.75%)  |   4932114 | (12.77%) |
| D2-1-6.Garmo1.2       |  36226049 |  23426597 | (64.67%) |  4002427 | (11.05%) | 2559540 | (7.07%)  |   6237485 | (17.22%) |
| D2-1-6.Garmo1.3       |  36125188 |  23838962 | (65.99%) |  3830479 | (10.60%) | 2411571 | (6.68%)  |   6044176 | (16.73%) |
| D2-1-6.Garmo1.4       |  35836517 |  23138334 | (64.57%) |  3824745 | (10.67%) | 2676098 | (7.47%)  |   6197340 | (17.29%) |
| D2-1-6.Garmo1.5       |   8192602 |   6048469 | (73.83%) |  1057375 | (12.91%) |  376139 | (4.59%)  |    710619 | (8.67%)  |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D2-2-7.Ghark1.2       |  35809677 |       402 | (0.00%)  |    13045 | (0.04%)  |   18874 | (0.05%)  |  35777356 | (99.91%) |
| D2-2-7.Ghark1.6       |  30487574 |       392 | (0.00%)  |    12627 | (0.04%)  |   17823 | (0.06%)  |  30456732 | (99.90%) |
| D2-2-7.Ghark1.1       |  36660687 |       324 | (0.00%)  |    13709 | (0.04%)  |   15707 | (0.04%)  |  36630947 | (99.92%) |
| D2-2-7.Ghark1.5       |  30955867 |       320 | (0.00%)  |    13133 | (0.04%)  |   14899 | (0.05%)  |  30927515 | (99.91%) |
| D2-2-7.Ghark1.3       |  31866196 |        53 | (0.00%)  |     4008 | (0.01%)  |    5219 | (0.02%)  |  31856916 | (99.97%) |
| D2-2-7.Ghark1.7       |  26420920 |        52 | (0.00%)  |     3769 | (0.01%)  |    4872 | (0.02%)  |  26412227 | (99.97%) |
| D2-2-7.Ghark1.4       |  29714327 |        33 | (0.00%)  |     1506 | (0.01%)  |    5133 | (0.02%)  |  29707655 | (99.98%) |
| D2-2-7.Ghark1.8       |  24763010 |        33 | (0.00%)  |     1445 | (0.01%)  |    4695 | (0.02%)  |  24756837 | (99.98%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D3-D-27.Gdavi1.1      |  40781175 |  30219833 | (74.10%) |  4090847 | (10.03%) | 1951446 | (4.79%)  |   4519049 | (11.08%) |
| D3-D-27.Gdavi1.3      |  42125772 |  29428492 | (69.86%) |  3855500 | (9.15%)  | 2812718 | (6.68%)  |   6029062 | (14.31%) |
| D3-D-27.Gdavi1.2      |  42250166 |  29012645 | (68.67%) |  4048927 | (9.58%)  | 2962658 | (7.01%)  |   6225936 | (14.74%) |
| D3-D-27.Gdavi1.4      |  41620373 |  28514036 | (68.51%) |  3860965 | (9.28%)  | 3095094 | (7.44%)  |   6150278 | (14.78%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D3-K-57.Gklot1.6      |  40312739 |  28382073 | (70.40%) |  4719143 | (11.71%) | 1935621 | (4.80%)  |   5275902 | (13.09%) |
| D3-K-57.Gklot1.5      |  39462286 |  27509955 | (69.71%) |  4836042 | (12.25%) | 1883652 | (4.77%)  |   5232637 | (13.26%) |
| D3-K-57.Gklot1.8      |  41056672 |  27046093 | (65.88%) |  6405033 | (15.60%) | 1751013 | (4.26%)  |   5854533 | (14.26%) |
| D3-K-57.Gklot1.7      |  40941656 |  26243664 | (64.10%) |  6767635 | (16.53%) | 1782531 | (4.35%)  |   6147826 | (15.02%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D4-12.Garid1.2        |  39021043 |  26462957 | (67.82%) |  5155999 | (13.21%) | 1817888 | (4.66%)  |   5584199 | (14.31%) |
| D4-12.Garid1.4        |  40577204 |  25660649 | (63.24%) |  7079692 | (17.45%) | 1642010 | (4.05%)  |   6194853 | (15.27%) |
| D4-12.Garid1.1        |  38160373 |  25624294 | (67.15%) |  5221266 | (13.68%) | 1779497 | (4.66%)  |   5535316 | (14.51%) |
| D4-12.Garid1.3        |  40435897 |  24801578 | (61.34%) |  7444264 | (18.41%) | 1684335 | (4.17%)  |   6505720 | (16.09%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D5-6.Graim2.3         |  30203570 |   9432837 | (31.23%) |  7988083 | (26.45%) |  974568 | (3.23%)  |  11808082 | (39.09%) |
| D5-6.Graim2.4         |  27972416 |   8307405 | (29.70%) |  7624105 | (27.26%) |  661814 | (2.37%)  |  11379092 | (40.68%) |
| D5-6.Graim2.5         |  25494733 |   7971549 | (31.27%) |  5748714 | (22.55%) | 1025508 | (4.02%)  |  10748962 | (42.16%) |
| D5-6.Graim2.1         |  22264778 |   7406834 | (33.27%) |  6972746 | (31.32%) |  576046 | (2.59%)  |   7309152 | (32.83%) |
| D5-6.Graim2.6         |  23827590 |   7036482 | (29.53%) |  5564444 | (23.35%) |  729518 | (3.06%)  |  10497146 | (44.05%) |
| D5-6.Graim2.2         |  21112858 |   6674726 | (31.61%) |  6678249 | (31.63%) |  373154 | (1.77%)  |   7386729 | (34.99%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D5-8.Graim1.7         | 104406163 |  51987947 | (49.79%) |  6721820 | (6.44%)  | 3859403 | (3.70%)  |  41836993 | (40.07%) |
| D5-8.Graim1.8         | 104860129 |  51592539 | (49.20%) |  7162892 | (6.83%)  | 4131037 | (3.94%)  |  41973661 | (40.03%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D6-5.Ggoss2.2         |  40904305 |  28824279 | (70.47%) |  4762902 | (11.64%) | 1989420 | (4.86%)  |   5327704 | (13.02%) |
| D6-5.Ggoss2.4         |  42655761 |  28138271 | (65.97%) |  6624088 | (15.53%) | 1846242 | (4.33%)  |   6047160 | (14.18%) |
| D6-5.Ggoss2.1         |  39926083 |  27859996 | (69.78%) |  4874589 | (12.21%) | 1929477 | (4.83%)  |   5262021 | (13.18%) |
| D6-5.Ggoss2.3         |  42421809 |  27226206 | (64.18%) |  6985323 | (16.47%) | 1878315 | (4.43%)  |   6331965 | (14.93%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D6-7.Ggoss1.5         |  41750205 |  12011184 | (28.77%) | 11371438 | (27.24%) | 1158723 | (2.78%)  |  17208860 | (41.22%) |
| D6-7.Ggoss1.6         |  38902199 |  10398575 | (26.73%) | 10965739 | (28.19%) |  722804 | (1.86%)  |  16815081 | (43.22%) |
| D6-7.Ggoss1.1         |  23633324 |   7300083 | (30.89%) |  6652727 | (28.15%) |  714613 | (3.02%)  |   8965901 | (37.94%) |
| D6-7.Ggoss1.3         |  21572078 |   6722480 | (31.16%) |  5295596 | (24.55%) |  770823 | (3.57%)  |   8783179 | (40.72%) |
| D6-7.Ggoss1.2         |  22032832 |   6460606 | (29.32%) |  6337201 | (28.76%) |  477851 | (2.17%)  |   8757174 | (39.75%) |
| D6-7.Ggoss1.4         |  20108899 |   5897607 | (29.33%) |  5104717 | (25.39%) |  527399 | (2.62%)  |   8579176 | (42.66%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D7-4.Globa1.1         |  42436431 |  30539785 | (71.97%) |  4600860 | (10.84%) | 2072746 | (4.88%)  |   5223040 | (12.31%) |
| D7-4.Globa1.3         |  42322151 |  28586284 | (67.54%) |  4069003 | (9.61%)  | 2957847 | (6.99%)  |   6709017 | (15.85%) |
| D7-4.Globa1.2         |  42475511 |  28147244 | (66.27%) |  4272876 | (10.06%) | 3116737 | (7.34%)  |   6938654 | (16.34%) |
| D7-4.Globa1.4         |  41998525 |  27776437 | (66.14%) |  4098603 | (9.76%)  | 3247219 | (7.73%)  |   6876266 | (16.37%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D8-8.Gtril2.1         | 155793983 |  99208016 | (63.68%) | 21810156 | (14.00%) | 9543439 | (6.13%)  |  25232372 | (16.20%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D8-9.Gtril1.1         |  47511013 |  32364569 | (68.12%) |  7546545 | (15.88%) |  998204 | (2.10%)  |   6601695 | (13.90%) |
| D8-9.Gtril1.2         |  47068194 |  31722725 | (67.40%) |  7614088 | (16.18%) | 1089084 | (2.31%)  |   6642297 | (14.11%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D9-4.Glaxu1.5         |  79477962 |  56330303 | (70.88%) | 13376437 | (16.83%) | 2804560 | (3.53%)  |   6966662 | (8.77%)  |
| D9-4.Glaxu1.1         |  32895444 |  23676719 | (71.98%) |  3536346 | (10.75%) | 1634549 | (4.97%)  |   4047830 | (12.31%) |
| D9-4.Glaxu1.3         |  25719064 |  17356440 | (67.48%) |  2422307 | (9.42%)  | 1859841 | (7.23%)  |   4080476 | (15.87%) |
| D9-4.Glaxu1.2         |  25856035 |  17122304 | (66.22%) |  2536855 | (9.81%)  | 1973447 | (7.63%)  |   4223429 | (16.33%) |
| D9-4.Glaxu1.4         |  25739549 |  17016378 | (66.11%) |  2448804 | (9.51%)  | 2060705 | (8.01%)  |   4213662 | (16.37%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D2-2.HFJ7YBGXX.1      |  21109359 |  13545858 | (64.17%) |  4267463 | (20.22%) |  654105 | (3.10%)  |   2641933 | (12.52%) |
| D2-2.HHGLTBGXX.2      |  25417578 |  13419693 | (52.80%) |  6523382 | (25.66%) |  836683 | (3.29%)  |   4637820 | (18.25%) |
| D2-2.HHGLTBGXX.1      |  24642011 |  12758624 | (51.78%) |  6376992 | (25.88%) |  850043 | (3.45%)  |   4656352 | (18.90%) |
| D2-2.HFJ7YBGXX.3      |  20996245 |  12741881 | (60.69%) |  4571488 | (21.77%) |  670136 | (3.19%)  |   3012740 | (14.35%) |
| D2-2.HFJ7YBGXX.2      |  21005836 |  12070074 | (57.46%) |  5212102 | (24.81%) |  643696 | (3.06%)  |   3079964 | (14.66%) |
| D2-2.HFJ7YBGXX.4      |  20941597 |  11749522 | (56.11%) |  5263675 | (25.14%) |  634246 | (3.03%)  |   3294154 | (15.73%) |
| D2-2.HHGLTBGXX.4      |  24725361 |  10725488 | (43.38%) |  7467243 | (30.20%) |  835391 | (3.38%)  |   5697239 | (23.04%) |
| D2-2.HHGLTBGXX.3      |  24277704 |  10673097 | (43.96%) |  7253413 | (29.88%) |  832372 | (3.43%)  |   5518822 | (22.73%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D3K-56.HFJ7YBGXX.1    |  19407761 |  12063746 | (62.16%) |  4245236 | (21.87%) |  570384 | (2.94%)  |   2528395 | (13.03%) |
| D3K-56.HHGLTBGXX.2    |  23032376 |  11594681 | (50.34%) |  6318032 | (27.43%) |  712012 | (3.09%)  |   4407651 | (19.14%) |
| D3K-56.HFJ7YBGXX.3    |  19271259 |  11278448 | (58.52%) |  4521283 | (23.46%) |  582359 | (3.02%)  |   2889169 | (14.99%) |
| D3K-56.HHGLTBGXX.1    |  22274152 |  10991839 | (49.35%) |  6151254 | (27.62%) |  726624 | (3.26%)  |   4404435 | (19.77%) |
| D3K-56.HFJ7YBGXX.2    |  19238095 |  10615090 | (55.18%) |  5117621 | (26.60%) |  560860 | (2.92%)  |   2944524 | (15.31%) |
| D3K-56.HFJ7YBGXX.4    |  19201131 |  10333431 | (53.82%) |  5156949 | (26.86%) |  552139 | (2.88%)  |   3158612 | (16.45%) |
| D3K-56.HHGLTBGXX.4    |  22314348 |   9124484 | (40.89%) |  7087683 | (31.76%) |  713154 | (3.20%)  |   5389027 | (24.15%) |
| D3K-56.HHGLTBGXX.3    |  21928474 |   9094164 | (41.47%) |  6897364 | (31.45%) |  711786 | (3.25%)  |   5225160 | (23.83%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D4-185.HFJ7YBGXX.1    |  19606636 |  12269710 | (62.58%) |  4280837 | (21.83%) |  591338 | (3.02%)  |   2464751 | (12.57%) |
| D4-185.HHGLTBGXX.2    |  23582511 |  12107896 | (51.34%) |  6399697 | (27.14%) |  746504 | (3.17%)  |   4328414 | (18.35%) |
| D4-185.HFJ7YBGXX.3    |  19477817 |  11513498 | (59.11%) |  4542912 | (23.32%) |  605229 | (3.11%)  |   2816178 | (14.46%) |
| D4-185.HHGLTBGXX.1    |  22631593 |  11412843 | (50.43%) |  6174906 | (27.28%) |  754017 | (3.33%)  |   4289827 | (18.96%) |
| D4-185.HFJ7YBGXX.2    |  19537747 |  10924564 | (55.92%) |  5158229 | (26.40%) |  581053 | (2.97%)  |   2873901 | (14.71%) |
| D4-185.HFJ7YBGXX.4    |  19520387 |  10648658 | (54.55%) |  5211426 | (26.70%) |  574122 | (2.94%)  |   3086181 | (15.81%) |
| D4-185.HHGLTBGXX.4    |  22869057 |   9633663 | (42.13%) |  7202610 | (31.50%) |  745727 | (3.26%)  |   5287057 | (23.12%) |
| D4-185.HHGLTBGXX.3    |  22280913 |   9522124 | (42.74%) |  6937593 | (31.14%) |  735965 | (3.30%)  |   5085231 | (22.82%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D7-157.HFJ7YBGXX.1    |  20122109 |  12781370 | (63.52%) |  4246029 | (21.10%) |  609135 | (3.03%)  |   2485575 | (12.35%) |
| D7-157.HHGLTBGXX.2    |  24299079 |  12758017 | (52.50%) |  6386231 | (26.28%) |  784711 | (3.23%)  |   4370120 | (17.98%) |
| D7-157.HFJ7YBGXX.3    |  20030295 |  12033471 | (60.08%) |  4526038 | (22.60%) |  625211 | (3.12%)  |   2845575 | (14.21%) |
| D7-157.HHGLTBGXX.1    |  22945144 |  11778561 | (51.33%) |  6107224 | (26.62%) |  771231 | (3.36%)  |   4288128 | (18.69%) |
| D7-157.HFJ7YBGXX.2    |  20146237 |  11491039 | (57.04%) |  5136889 | (25.50%) |  608448 | (3.02%)  |   2909861 | (14.44%) |
| D7-157.HFJ7YBGXX.4    |  20207063 |  11255236 | (55.70%) |  5214797 | (25.81%) |  602786 | (2.98%)  |   3134244 | (15.51%) |
| D7-157.HHGLTBGXX.4    |  23513697 |  10178113 | (43.29%) |  7204949 | (30.64%) |  783855 | (3.33%)  |   5346780 | (22.74%) |
| D7-157.HHGLTBGXX.3    |  22627262 |   9893862 | (43.73%) |  6881473 | (30.41%) |  759235 | (3.36%)  |   5092692 | (22.51%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A1-97                 | 110663838 |  94898422 | (85.75%) |        5 | (0.00%)  |       0 | (0.00%)  |  15765411 | (14.25%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A1-73                 |   2245275 |     23164 | (1.03%)  |        0 | (0.00%)  |       0 | (0.00%)  |   2222111 | (98.97%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A1-155                | 385549392 | 268517673 | (69.65%) |       10 | (0.00%)  |       0 | (0.00%)  | 117031709 | (30.35%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2-BGI                |  84232465 |  83083395 | (98.64%) |        0 | (0.00%)  |       0 | (0.00%)  |   1149070 | (1.36%)  |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2-JCVI               |  38965101 |  35545475 | (91.22%) |        9 | (0.00%)  |       0 | (0.00%)  |   3419617 | (8.78%)  |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2_44                 |  78180657 |  68451959 | (87.56%) |       10 | (0.00%)  |       0 | (0.00%)  |   9728688 | (12.44%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2_1011               | 412359904 | 292868284 | (71.02%) |        5 | (0.00%)  |       0 | (0.00%)  | 119491615 | (28.98%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2_4                  | 343470023 | 249161465 | (72.54%) |       24 | (0.00%)  |       0 | (0.00%)  |  94308534 | (27.46%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| A2_34                 | 367844399 | 267332300 | (72.68%) |        5 | (0.00%)  |       0 | (0.00%)  | 100512094 | (27.32%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| D5_ref                | 107815573 |  94698687 | (87.83%) |       98 | (0.00%)  |       0 | (0.00%)  |  13116788 | (12.17%) |
|-----------------------+-----------+-----------+----------+----------+----------+---------+----------+-----------+----------|
| F1-1                  | 534258839 | 414484152 | (77.58%) |       26 | (0.00%)  |       0 | (0.00%)  | 119774661 | (22.42%) |


Read files for AD1-DNWC1324.Ghirs1, D8-9.Gtril1, D5-6.Graim2, D5-8.Graim1, and
D6-7.Ggoss1 needed to be fixed.

#+BEGIN_SRC sh
for file in trim/{AD1-DNWC1324.Ghirs1,D8-9.Gtril1,D5-6.Graim2,D5-8.Graim1,D6-7.Ggoss1}*.gz; do 
    zcat $file | awk '{sub(":0:0 ", ":" NR " ", $0); print}' | gzip > $file.clean; 
done

for file in trim/D6-7.Ggoss1.3.*.gz; do
    pv $file | zcat  | 
    awk '{gsub("2207:2006:10197", "2207:2006:10197:" NR, $0); print}' | 
    gzip > $file.clean
done
#+END_SRC
* Phylogenetics
:PROPERTIES:
:ID:       e4707bd9-e531-4c62-99db-337ee7d990ce
:END:


#+BEGIN_SRC sh :var libs=read_groups :var DIR=(file-name-directory buffer-file-name)
ls -S analysis//d.align/*.all.bam | parallel -j6 --tag samtools flagstat {} '|' sed -n '"5s/ .*//p"' | awk '{$2 = $2 * 85 / 880000000;
print $0}'
#+END_SRC

#+RESULTS:
#+Caption: Estimated Aligned Coverage of D5 (calculated: #mapped_reads * 85 / 880000000)
| Species             | Aligned Coverage |
|---------------------+------------------|
| F1-1                |          55.1884 |
| D11-1.Gschw1        |          44.8914 |
| AD1-DNWC1324.Ghirs1 |          39.1531 |
| A1-155              |          31.1633 |
| A2_1011             |          29.4754 |
| A2_34               |          28.8972 |
| D9-4.Glaxu1         |          28.6264 |
| A2_4                |          28.1183 |
| D1-35.Gthur2        |          27.3339 |
| D3-D-27.Gdavi1      |          25.1444 |
| D7-4.Globa1         |          24.8381 |
| D6-5.Ggoss2         |           24.498 |
| D3-K-57.Gklot1      |           23.949 |
| D2-2                |          23.8639 |
| D4-12.Garid1        |          22.8186 |
| D2-1-6.Garmo1       |          22.6315 |
| D7-157              |          22.5818 |
| D8-8.Gtril2         |          22.1751 |
| D5-8.Graim1         |          22.1262 |
| D4-185              |          21.7826 |
| D3K-56              |          21.2111 |
| D5_ref              |          18.2169 |
| D6-7.Ggoss1         |          14.2018 |
| D8-9.Gtril1         |          14.0253 |
| D5-6.Graim2         |          13.4317 |
| D1-2.Gthur1         |          11.2287 |
| A1-97               |          10.9869 |
| D10-8.Gturn1        |          8.66369 |
| A2_44               |          7.71567 |
| A2-BGI              |          7.49856 |
| A2-JCVI             |          3.82104 |
| D2-2-7.Ghark1       |        0.0131961 |
| A1-73               |       0.00241941 |



#+HEADER: :shebang #!/bin/bash :tangle analysis/phylo/bam2consensus/high_cov/run.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N Merge -l nodes=1:ppn=20 -l walltime=48:00:00
#+BEGIN_SRC sh  :var libs=read_groups :var DIR=(file-name-directory buffer-file-name)
LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/usr/local/igbb/bambam-1.3/lib
LD_LIBRARY_PATH=$LD_LIBRARY_PATH:/usr/local/igbb/htslib-1.1/lib/
PATH=$PATH:/usr/local/igbb/bambam-1.3/bin

# lfs setstripe -s 1536k -i -1 -c 1 analysis/phylo/bam2consensus/
cd analysis/phylo/bam2consensus/high_cov

bams=$(cut -f 4 <<<"$libs" |
    sort -u | grep -v -e AD1-DNWC1324.Ghirs1 -e A1-73  -e D2-2-7.Ghark1 -e A2-JCVI |
    sed 's#D10-8#minlen60/D10-8#' |
    xargs printf "$DIR/analysis/d.align/%s.all.bam " )

seq -w 0 37 |  parallel -j20 mkdir {} ';' cd {} ';' bam2consensus -g $DIR/db/D5.CDS_range.gff.{}.gff -m 20 $bams


#+END_SRC


#+HEADER: :shebang #!/bin/bash :tangle analysis/phylo/bayes/run.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N MrBayes -l nodes=1:ppn=20 -l walltime=48:00:00
#+BEGIN_SRC sh  :var DIR=(file-name-directory buffer-file-name)
PATH=/usr/local/igbb/mrbayes-3.2.5/bin/:/usr/local/mpi/x86_64/openmpi-1.8.2/bin:$PATH
LD_LIBRARY_PATH=/usr/local/mpi/x86_64/openmpi-1.8.2/lib:$LD_LIBRARY_PATH
cd $DIR/analysis/phylo/bayes/run/


S=$[ ${PBS_ARRAYID} * 50 + 1 ]
E=$[ ${PBS_ARRAYID} * 50 + 50]

for file in $(find $DIR/analysis/phylo/bayes -name *.nxs | sed -n ${S},${E}p); do
    mpirun -np 20 mb $file > $file.stdout
done
#+END_SRC


#+HEADER: :shebang #!/bin/bash :tangle analysis/phylo/raxml_runs/raxml.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N raxML -l nodes=1:ppn=12 -l walltime=72:00:00 -q q48p192h
#+BEGIN_SRC sh  :var DIR=(file-name-directory buffer-file-name)
swsetup ()
{
    eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`
}

swsetup gcc-4.8

PATH=$PATH:$DIR/bin/standard-RAxML-8.2.9/

cd $PBS_O_WORKDIR/

S=$[ ${PBS_ARRAYID} * 50 + 1 ]
E=$[ ${PBS_ARRAYID} * 50 + 50]
# for file in $(find $INPUT -name *.phy | sed -n ${S},${E}p); do
#     cd $(dirname $file)
#     raxmlHPC-PTHREADS-SSE3 -f a -k -m GTRGAMMA -o F1_1 -p 25632 -T 12 -s ${file} -x 451842 -n $(basename $file .phy).GTRGAMMA.raxml -N 10000
# done

#Rerun incomplete files
# find `pwd`/analysis/phylo/raxml_runs/raxml_alt -name "*.phy" |
#     perl -lane '(my $t = $_) =~ s#/(Gorai.*).phy#/RAxML_bestTree.$1.GTRGAMMA.raxml#;
#                   print $_ unless -f $t' > analysis/phylo/raxml_runs/raxml_alt.rerun

for file in $(sed -n ${S},${E}p analysis/phylo/raxml_runs/raxml_alt.rerun); do
    cd $(dirname $file)
    raxmlHPC-PTHREADS-SSE3 -f a -k -m GTRGAMMA -o F1_1 -p 25632 -T 12 -s ${file} -x 451842 -n $(basename $file .phy).GTRGAMMA.raxml.rerun -N 10000
done
#+END_SRC
* Clustering
:PROPERTIES:
:ID:       7e911400-13e1-4640-a4ef-8ef54d595e06
:END:

The highest technical replicate was chosen to represent each species. D2-2-7,
A1-73, and A2-JCVI were removed from further analysis because the number of paired reads
passing filtering was less than the number of reads needed to sample the
genome. Sampling rate is 1% of genome size; actual numbers shown in Table [[sample_tbl]].

Custom Cotton repeate database (analysis/clustering/custom_library.fasta) came from ISU.

RepeatExplorer crashing with cryptic error messages. Trying without 2nd reads
and '--paired' parameter.

#+BEGIN_SRC sh :var libs=trim_stats
cat <<<"$libs" | uniq -w 11 
#+END_SRC

#+RESULTS:
#+CAPTION: Sampling Rates
#+NAME: sample_tbl
| Library            | Sample Name | Genome Size (Mb) | Sampling (Mb) | Number of reads |
|--------------------+-------------+------------------+---------------+-----------------|
| D10-8.Gturn1.9     | D10-8_      |              910 |           9.1 |          107059 |
| D11-1.Gschw1.7     | D11-1_      |              929 |          9.29 |          109295 |
| D1-2.Gthur1.7      | D1-2__      |              841 |          8.41 |           98942 |
| D1-35.Gthur2.5     | D1-35_      |              841 |          8.41 |           98942 |
| D2-1-6.Garmo1.5    | D2-1-6      |              856 |          8.56 |          100706 |
| D3-D-27.Gdavi1.1   | D3-D-2      |              910 |           9.1 |          107059 |
| D3-K-57.Gklot1.6   | D3-K-5      |              880 |           8.8 |          103530 |
| D4-12.Garid1.2     | D4-12_      |              919 |          9.19 |          108118 |
| D5-6.Graim2.1      | D5-6__      |              880 |           8.8 |          103530 |
| D5-8.Graim1.7      | D5-8__      |              880 |           8.8 |          103530 |
| D6-5.Ggoss2.2      | D6-5__      |              841 |          8.41 |           98942 |
| D6-7.Ggoss1.3      | D6-7__      |              841 |          8.41 |           98942 |
| D7-4.Globa1.1      | D7-4__      |              934 |          9.34 |          109883 |
| D8-8.Gtril2.1      | D8-8__      |              851 |          8.51 |          100118 |
| D8-9.Gtril1.1      | D8-9__      |              851 |          8.51 |          100118 |
| D9-4.Glaxu1.1      | D9-4__      |              934 |          9.34 |          109883 |
| A1-97              | A1-97_      |             1667 |         16.67 |          196118 |
| A1-155             | A1-155      |             1667 |         16.67 |          196118 |
| A2_1011            | A2_101      |             1698 |         16.98 |          199765 |
| A2_34              | A2_34_      |             1698 |         16.98 |          199765 |
| D5_ref             | D5_ref      |              880 |           8.8 |          103530 |
| F1-1               | F1-1__      |             1311 |         13.11 |          154236 |
| D2-2.HFJ7YBGXX.1   | D2-2__      |              910 |           9.1 |          107059 |
| D3K-56.HFJ7YBGXX.1 | D3K-56      |              880 |           8.8 |          103530 |
| D4-185.HFJ7YBGXX.1 | D4-185      |              919 |          9.19 |          108118 |
| D7-157.HFJ7YBGXX.1 | D7-157      |              934 |          9.34 |          109883 |
#+TBLFM: $4=$3*0.01::$5=ceil($4*1000000/85)

#+BEGIN_SRC sh :var libs=sample_tbl :var DIR=(file-name-directory buffer-file-name)
while read -a lib; do
    echo ${lib[0]}
    zcat $DIR/trim/${lib[0]}.PE.R1.fq.gz | head -1
done <<< "$libs" | paste - - | tr ':' '\t'

#+END_SRC

#+RESULTS:
| Sample             | Machine  | Flowcell        | Lane |
|--------------------+----------+-----------------+------|
| D10-8.Gturn1.9     | NS500367 | H04JDAFXX       |    1 |
| D11-1.Gschw1.7     |          | FCH9RUVADXX     |    2 |
| D1-2.Gthur1.7      | M01019   | 000000000-AAJFR |    1 |
| D1-35.Gthur2.5     |          | FCH9RUVADXX     |    2 |
| D2-1-6.Garmo1.5    |          | FCH9RUVADXX     |    2 |
| D3-D-27.Gdavi1.1   |          | FCC57CHACXX     |    5 |
| D3-K-57.Gklot1.6   |          | FCC57AFACXX     |    2 |
| D4-12.Garid1.2     |          | FCC57AFACXX     |    2 |
| D5-6.Graim2.1      | SN677    | HABYUADXX       |    1 |
| D5-8.Graim1.7      | SN677    | HABTTADXX       |    1 |
| D6-5.Ggoss2.2      |          | FCC57AFACXX     |    2 |
| D6-7.Ggoss1.3      | SN677    | HABYUADXX       |    1 |
| D7-4.Globa1.1      |          | FCC57CHACXX     |    5 |
| D8-8.Gtril2.1      |          | FCD2EUDACXX     |    1 |
| D8-9.Gtril1.1      | SN677    | HABTTADXX       |    1 |
| D9-4.Glaxu1.1      |          | FCC57CHACXX     |    5 |
| D2-2.HFJ7YBGXX.1   | NS500367 | HFJ7YBGXX       |    1 |
| D3K-56.HFJ7YBGXX.1 | NS500367 | HFJ7YBGXX       |    1 |
| D4-185.HFJ7YBGXX.1 | NS500367 | HFJ7YBGXX       |    1 |
| D7-157.HFJ7YBGXX.1 | NS500367 | HFJ7YBGXX       |    1 |

 
#+HEADER: :shebang #!/bin/bash :tangle analysis/clustering/sample.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N Sample -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var libs=sample_tbl :var DIR=(file-name-directory buffer-file-name)
PATH=$PATH:$DIR/bin/reservoir_sample

while read -a lib; do
    reservoir_sample -l 85 -n ${lib[1]} -s ${lib[4]} $DIR/trim/${lib[0]}.PE.R1.fq.gz
done <<< "$libs" > $DIR/analysis/clustering/sample.fa
#+END_SRC


#+HEADER: :shebang "#!/bin/bash" :mkdirp t :tangle analysis/clustering/cluster.sh
#+HEADER: :prologue #PBS -N RepeatExplorer -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name)
export R_LIBS=$DIR/bin/repeatexplorer/Rlib:$R_LIBS

PATH="$PATH:$DIR/bin/repeatexplorer"
PATH="$PATH:$DIR/bin/repeatexplorer/blast-2.2.26/bin"
PATH="$PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/bin"
PATH="$PATH:/usr/local/R-3.1.2/bin"
export PATH

LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/lib/
export LD_LIBRARY_PATH

swsetup () { eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`; }
swsetup repeatmasker
swsetup bioperl

cd $DIR/analysis/clustering/ || exit

if [ -d $DIR/analysis/clustering/seqClust ]; then rm -R $DIR/analysis/clustering/seqClust; fi

exec 3>&1 4>&2 >$PBS_JOBID.log 2>&1

while sleep 30; do find . -type d -empty -print -exec touch {}/.empty \;; done &
WATCH=$!

time seqclust_cmd.py -s $DIR/analysis/clustering/sample.fa \
    -d None -v . -k  $DIR/db/RBplantsANDcotton.21.08.fasta -f 6

kill $WATCH
exec 1>&3 2>&4
#+END_SRC


  #+HEADER: :shebang "#!/bin/bash" :mkdirp t :tangle analysis/clustering/cluster_continue.sh
#+HEADER: :prologue #PBS -N RepeatExplorer -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name)
export R_LIBS=$DIR/bin/repeatexplorer/Rlib:$R_LIBS

PATH="$PATH:$DIR/bin/repeatexplorer"
PATH="$PATH:$DIR/bin/repeatexplorer/blast-2.2.26/bin"
PATH="$PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/bin"
PATH="$PATH:/usr/local/R-3.1.2/bin"
export PATH

LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/lib/
export LD_LIBRARY_PATH

swsetup () { eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`; }
swsetup repeatmasker
swsetup bioperl

cd $DIR/analysis/clustering/ || exit

exec 3>&1 4>&2 >$PBS_JOBID.log 2>&1

while sleep 30; do find . -type d -empty -print -exec touch {}/.empty \;; done &
WATCH=$!

time seqclust_continue.py -s $DIR/analysis/clustering/sample.fa \
    -d None -v . -k  $DIR/db/RBplantsANDcotton.21.08.fasta -f 6


kill $WATCH
exec 1>&3 2>&4
#+END_SRC



#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name)
  PATH=$PATH:/usr/local/gnu/bin
  find $DIR/analysis/clustering/seqClust/clustering/clusters -name '*_domains.csv' |\
      parallel -k --tag awk "'NR!=1 {if(\$3 == \"NA\"){print \$1}else{print \$3}}'" {} '|' sort -u |\
      sed -e 's#[^\t]*/##' -e 's/_domains.csv//' | tr -d '"' | sort -n |\
      awk 'length(head)==0 {printf "Cluster\tLineage"} head != $1 {printf "\n%s\t%s", $1,$2} head==$1{printf ",%s", $2} {head=$1}' |\
      paste - $DIR/analysis/clustering/seqClust/clustering/comparativeAnalysis_table_clusters.csv \
            > $DIR/analysis/clustering/seqClust/clustering/comparative_analysis.domains.txt

  # mv $DIR/analysis/clustering/{seqClust/clustering,}
  # tar -C $DIR/analysis/clustering/ -cvzf $DIR/analysis/clustering/clusters.tar.gz clustering/ summary/ comparative_analysis.domains.txt
#+END_SRC

#+RESULTS:


#+HEADER: :shebang "#!/usr/bin/perl" :results output :tangle bin/annotate.pl
#+BEGIN_SRC perl :var DIR=(file-name-directory buffer-file-name)
use strict;
use warnings;

use Data::Dumper;

local $\ = "\n";
local $, = "\t";

# Use file analysis/clustering/seqClust/clustering/RM-custom_output_tablesummary.csv
my $cluster_file = shift;

open(my $cluster_fh, $cluster_file);

my $header = <$cluster_fh>;
chomp $header;
$header = [split /\t/, $header];
splice @$header, 0, 3;

print "Cluster", "Lineage";

while(<$cluster_fh>){
     next unless s/^hits //;
     chomp;

     my ($cluster, $length, $sum, $tmp) = split /\t/, $_, 4;
     my $repeats = {};
     @$repeats{@$header} = map {s/\s//g; $_} split /\t/, $tmp;

     $cluster =~ s#clusters/dir_([^/]*)/#$1#;

     # Combine 'gypsy' and 'LTR/Gypsy' elements
     $repeats->{'LTR/Gypsy'} += $repeats->{gypsy};
     delete $repeats->{'gypsy'};

     # Remove 'Unknown' elements
     delete $repeats->{Unknown};

     # Sort elements descending by count 
     my $sort_header = [sort {$repeats->{$b} <=> $repeats->{$a}} keys %$repeats];

     # Check if first element is 'LTR'
     if($sort_header->[0] eq 'LTR'){
         # If second element is an LTR and third element is not LTR or is less
         # than half the second, add the first and second elements together and
         # remove the LTR element
         if ($sort_header->[1] =~ /^LTR/){
             if($sort_header->[2] !~ /^LTR/ || 
                $repeats->{$sort_header->[1]}/2 > $repeats->{$sort_header->[2]}){
                 
                 $repeats->{$sort_header->[1]} += $repeats->{LTR};
                 delete $repeats->{LTR};
             }
         # If second element is non-LTR and is larger than half the LTR,
         # classify cluster as Retroelement
         }elsif($sort_header->[1] eq 'non-LTR_retroposon' && 
                $repeats->{$sort_header->[0]}/2 < $repeats->{$sort_header->[1]}){
             print $cluster, 'Retroelement';
             next;
         }
     }else{
         # Remove LTR if not first element
         delete $repeats->{LTR};
     }
     # Resort elements
     $sort_header = [sort {$repeats->{$b} <=> $repeats->{$a}} keys %$repeats];

     # IF the top two elements are LTR, they're close in size, and are larger
     # than 10% of the cluster, classify cluster as 'LTR'
     if($sort_header->[0] =~ /^LTR/ && $sort_header->[1] =~ /^LTR/ && 
        $repeats->{$sort_header->[0]}/2 < $repeats->{$sort_header->[1]} &&
        ($repeats->{$sort_header->[0]}+$repeats->{$sort_header->[1]})/$sum > .1){
         print $cluster, 'LTR';
         next;
     }

     # If the first element is 'DNA' and the second element is a DNA element,
     # add the elements together and delete the DNA element
     if($sort_header->[0] eq 'DNA'){
         if ($sort_header->[1] =~ /^DNA/){
                 $repeats->{$sort_header->[1]} += $repeats->{DNA};
                 delete $repeats->{DNA};
         }
     }else{
         # Remove DNA if not first element
         delete $repeats->{DNA};
     }
     # Resort elements
     $sort_header = [sort {$repeats->{$b} <=> $repeats->{$a}} keys %$repeats];


     # If top element is larger than 10% total count and is 1.5x larger than
     # second element, classify cluster as the top element; else leave the
     # cluster unclassified (*).
     if($repeats->{$sort_header->[0]}/$sum > .1 && 
        $repeats->{$sort_header->[0]}/($repeats->{$sort_header->[1]}+1) > 1.5){
         print $cluster,  $sort_header->[0];
     }else{
         print $cluster, '*';
     }

}
close($cluster_fh);
#+END_SRC

#+RESULTS:


*** D5 triplicate
:PROPERTIES:
:ID:       32d48f1c-5792-4beb-9087-53d23b866ea3
:END:
#+RESULTS:
#+CAPTION: Sampling Rates
#+NAME: sample_trip_tbl
| Library            | Sample Name | Genome Size (Mb) | Sampling (Mb) | Number of reads |
|--------------------+-------------+------------------+---------------+-----------------|
| D10-8.Gturn1.9     | D10-8_      |              910 |           9.1 |          107059 |
| D11-1.Gschw1.7     | D11-1_      |              929 |          9.29 |          109295 |
| D1-2.Gthur1.7      | D1-2__      |              841 |          8.41 |           98942 |
| D1-35.Gthur2.5     | D1-35_      |              841 |          8.41 |           98942 |
| D2-1-6.Garmo1.5    | D2-1-6      |              856 |          8.56 |          100706 |
| D3-D-27.Gdavi1.1   | D3-D-2      |              910 |           9.1 |          107059 |
| D3-K-57.Gklot1.6   | D3-K-5      |              880 |           8.8 |          103530 |
| D4-12.Garid1.2     | D4-12_      |              919 |          9.19 |          108118 |
| D5-6.Graim2.1      | D5-6_1      |              880 |           8.8 |          103530 |
| D5-6.Graim2.1      | D5-6_2      |              880 |           8.8 |          103530 |
| D5-6.Graim2.1      | D5-6_3      |              880 |           8.8 |          103530 |
| D5-8.Graim1.7      | D5-8__      |              880 |           8.8 |          103530 |
| D6-5.Ggoss2.2      | D6-5__      |              841 |          8.41 |           98942 |
| D6-7.Ggoss1.3      | D6-7__      |              841 |          8.41 |           98942 |
| D7-4.Globa1.1      | D7-4__      |              934 |          9.34 |          109883 |
| D8-8.Gtril2.1      | D8-8__      |              851 |          8.51 |          100118 |
| D8-9.Gtril1.1      | D8-9__      |              851 |          8.51 |          100118 |
| D9-4.Glaxu1.1      | D9-4__      |              934 |          9.34 |          109883 |
| A1-97              | A1-97_      |             1667 |         16.67 |          196118 |
| A1-155             | A1-155      |             1667 |         16.67 |          196118 |
| A2_1011            | A2_101      |             1698 |         16.98 |          199765 |
| A2_34              | A2_34_      |             1698 |         16.98 |          199765 |
| D5_ref             | D5_ref      |              880 |           8.8 |          103530 |
| F1-1               | F1-1__      |             1311 |         13.11 |          154236 |
| D2-2.HFJ7YBGXX.1   | D2-2__      |              910 |           9.1 |          107059 |
| D3K-56.HFJ7YBGXX.1 | D3K-56      |              880 |           8.8 |          103530 |
| D4-185.HFJ7YBGXX.1 | D4-185      |              919 |          9.19 |          108118 |
| D7-157.HFJ7YBGXX.1 | D7-157      |              934 |          9.34 |          109883 |
#+TBLFM: $4=$3*0.01::$5=ceil($4*1000000/85)



 
#+HEADER: :shebang #!/bin/bash :tangle analysis/clustering/trip/sample.pbs :mkdirp yes
#+HEADER: :prologue #PBS -N Sample -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var libs=sample_trip_tbl :var DIR=(file-name-directory buffer-file-name)
PATH=$PATH:$DIR/bin/reservoir_sample

while read -a lib; do
    reservoir_sample -l 85 -n ${lib[1]} -s ${lib[4]} $DIR/trim/${lib[0]}.PE.R1.fq.gz
done <<< "$libs" > $DIR/analysis/clustering/trip/sample.fa
#+END_SRC



#+HEADER: :shebang "#!/bin/bash" :mkdirp t :tangle analysis/clustering/trip/cluster.sh
#+HEADER: :prologue #PBS -N RepeatExplorer -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name)
export R_LIBS=$DIR/bin/repeatexplorer/Rlib:$R_LIBS

PATH="$PATH:$DIR/bin/repeatexplorer"
PATH="$PATH:$DIR/bin/repeatexplorer/blast-2.2.26/bin"
PATH="$PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/bin"
PATH="$PATH:/usr/local/R-3.1.2/bin"
export PATH

LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/lib/
export LD_LIBRARY_PATH

swsetup () { eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`; }
swsetup repeatmasker
swsetup bioperl

cd $DIR/analysis/clustering/trip || exit

if [ -d $DIR/analysis/clustering/trip/seqClust ]; then rm -R $DIR/analysis/clustering/trip/seqClust; fi

exec 3>&1 4>&2 >$PBS_JOBID.log 2>&1

while sleep 30; do find . -type d -empty -print -exec touch {}/.empty \;; done &
WATCH=$!

time seqclust_cmd.py -s $DIR/analysis/clustering/trip/sample.fa \
    -d None -v . -f 6

kill $WATCH
exec 1>&3 2>&4
#+END_SRC

#+HEADER: :shebang "#!/bin/bash" :mkdirp t :tangle analysis/clustering/trip/cluster_continue.sh
#+HEADER: :prologue #PBS -N RepeatExplorer -l nodes=1:ppn=20 -l walltime=48:00:00 
#+BEGIN_SRC sh :var DIR=(file-name-directory buffer-file-name)
export R_LIBS=$DIR/bin/repeatexplorer/Rlib:$R_LIBS

PATH="$PATH:$DIR/bin/repeatexplorer"
PATH="$PATH:$DIR/bin/repeatexplorer/blast-2.2.26/bin"
PATH="$PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/bin"
PATH="$PATH:/usr/local/R-3.1.2/bin"
export PATH

LD_LIBRARY_PATH=$LD_LIBRARY_PATH:$DIR/bin/repeatexplorer/ImageMagick-6.9.1-10/lib/
export LD_LIBRARY_PATH

swsetup () { eval `/usr/erc-share/etc/swsetup/swsetup.pl $*`; }
swsetup repeatmasker
swsetup bioperl

cd $DIR/analysis/clustering/trip || exit

exec 3>&1 4>&2 >$PBS_JOBID.log 2>&1

while sleep 30; do find . -type d -empty -print -exec touch {}/.empty \;; done &
WATCH=$!

time seqclust_continue.py -s $DIR/analysis/clustering/trip/sample.fa \
    -d None -v . -f 6


kill $WATCH
exec 1>&3 2>&4
#+END_SRC




